Autodesk.Revit.DB.ImageBackgroundSettings.OffsetHeight
The vertical offset of the rendering image to the rendering region.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for height must be no more than 30000 feet in absolute value.
Since:
2013

Autodesk.Revit.DB.ImageBackgroundSettings.OffsetWidth
The horizontal offset of the rendering image to the rendering region.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for width must be no more than 30000 feet in absolute value.
Since:
2013

Autodesk.Revit.DB.ImageBackgroundSettings.BackgroundImageFit
The background image fit type.
Remarks:
This value indicates how scale should be applied to the image in order to fit it to a page or screen.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ImageBackgroundSettings.FilePath
File path of the image for the rendering background.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The file specified by path is not an image file.
A valid image file should be in one of the following formats: bmp, jpg, jpeg, png, tif.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
When setting this property: The  file specified by path doesn't exist.
Since:
2013

Autodesk.Revit.DB.ImageBackgroundSettings
Represents the rendering image background settings.
Since:
2013